## Pandas 학습

### 라이브러리 추가
```python
!pip install pandas
```

In [81]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
```python
import pandas as pd
```

In [82]:
import pandas as pd

### 판다스 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터
- 열(column) 유니크 데이터의 하나하나 특성

In [83]:
## 딕셔너리로 DataFrame 객체 생성
data = {'이름':['이윤지','홍길동','김성국'], '나이':[28, 20, 29], '결혼':[True, False, False]}
df = pd.DataFrame(data=data)
df

    이름  나이     결혼
0  이윤지  28   True
1  홍길동  20  False
2  김성국  29  False

In [84]:
## 2차원 리스트 생성
data = [['이윤지', 28, '부산', 'dbswl341@naver.com', True],['홍길동', 20, '서울','ghdrlfehd@naver.com', False],
        ['김성국', 29, '경남', 'tjdrnr1217@naver.com', False]]
data

[['이윤지', 28, '부산', 'dbswl341@naver.com', True],
 ['홍길동', 20, '서울', 'ghdrlfehd@naver.com', False],
 ['김성국', 29, '경남', 'tjdrnr1217@naver.com', False]]

In [85]:
## 2차원 리스트 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소                   이메일     결혼
0  이윤지  28  부산    dbswl341@naver.com   True
1  홍길동  20  서울   ghdrlfehd@naver.com  False
2  김성국  29  경남  tjdrnr1217@naver.com  False

In [86]:
## DataFrame에서 데이터 조회(열)
df['이름']

0    이윤지
1    홍길동
2    김성국
Name: 이름, dtype: object

In [87]:
## 데이터프레임 조회(두개의 열)
df[['이름', '나이']]

    이름  나이
0  이윤지  28
1  홍길동  20
2  김성국  29

In [88]:
## 데이터프레임 행으로 조회
df.loc[0]

이름                    이윤지
나이                     28
주소                     부산
이메일    dbswl341@naver.com
결혼                   True
Name: 0, dtype: object

In [89]:
## 데이터프레임 조회(행)
df.loc[[0, 1]]

    이름  나이  주소                  이메일     결혼
0  이윤지  28  부산   dbswl341@naver.com   True
1  홍길동  20  서울  ghdrlfehd@naver.com  False

In [90]:
# 현재 데이터프레임 확인
df

    이름  나이  주소                   이메일     결혼
0  이윤지  28  부산    dbswl341@naver.com   True
1  홍길동  20  서울   ghdrlfehd@naver.com  False
2  김성국  29  경남  tjdrnr1217@naver.com  False

In [91]:
## 새 컬럼 추가
df['전번'] = ['01099999999','01088888888','01077777777']

In [92]:
#추가된 데이터 프레임 확인
df

    이름  나이  주소                   이메일     결혼           전번
0  이윤지  28  부산    dbswl341@naver.com   True  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  False  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  False  01077777777

In [93]:
## 열 삭제, axis=0(행), 1(열)
df.drop('결혼', axis=1)

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777

In [94]:
## drop()은 삭제하고 출력해줌, 완전히 삭제하려면 inplace 옵션을 사용
# inplace를 화면에 출력안됨
df.drop('결혼', axis=1, inplace=True)

In [95]:
# 삭제를 확인
df

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777

In [96]:
## 행추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gmail.com', '01055555555']

In [97]:
df

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777
4  손흥민  32  런던         shm@gmail.com  01055555555

In [100]:
## 행삭제, 완전히 삭제하려면 inplace를 쓰거나 아니면 다른 변수에 재할당
df2 = df.drop(4)

In [101]:
df2

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
1  홍길동  20  서울   ghdrlfehd@naver.com  01088888888
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777

In [104]:
## 행삭제 inplace, axis=0만 사용 또는 생략
df.drop(1, axis=0, inplace=True)

In [105]:
df

    이름  나이  주소                   이메일           전번
0  이윤지  28  부산    dbswl341@naver.com  01099999999
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777
4  손흥민  32  런던         shm@gmail.com  01055555555

In [110]:
## 열 이름을 변경
df.rename(columns={'전번':'휴대폰'}, inplace=True)
df

    이름  나이  주소                   이메일          휴대폰
0  이윤지  28  부산    dbswl341@naver.com  01099999999
2  김성국  29  경남  tjdrnr1217@naver.com  01077777777
4  손흥민  32  런던         shm@gmail.com  01055555555

- 데이터프레임은 파이썬의 2차원 리스트와 동일하지만, 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

-